n5/src/Enums/PropertiesScope/PropertiesScope.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PropertiesScope</name>
  <enumValues>
    <name>Item</name>
  </enumValues>
  <enumValues>
    <name>Groups</name>
  </enumValues>
  <enumValues>
    <name>Items</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/PropertiesUsage/PropertiesUsage.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PropertiesUsage</name>
  <enumValues>
    <name>Inherit</name>
  </enumValues>
  <enumValues>
    <name>Special</name>
  </enumValues>
  <enumValues>
    <name>None</name>
  </enumValues>
</mdclass:Enum>

n5/src/CommonModules/OptionalPropertiesSrv/Module.bsl
Function GetOwner ( val Ref, val Folder, val Scope ) export
	
	if ( Scope = Enums.PropertiesScope.Groups ) then
		usage = "GroupsUsage";
	else
		usage = "ItemsUsage";
	endif; 
	s = "
	|select Items.Ref as Ref, Items.Parent as Parent, Items." + usage + " as Usage
	|from Catalog." + Folder.Metadata ().Name + " as Items
	|where Items.Ref = &Folder
	|";
	q = new Query ( s );
	q.SetParameter ( "Folder", Folder );
	special = Enums.PropertiesUsage.Special;
	while ( true ) do
		table = q.Execute ().Unload ();
		if ( table.Count () = 0 ) then
			return undefined;
		endif;
		data = table [ 0 ];
		if ( data.Usage = special ) then
			return data.Ref;
		endif; 
		q.SetParameter ( "Folder", data.Parent );
	enddo; 
	
EndFunction
